# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

import os

os.system('cls')

print('Найдем разницу дробной части элементов массива, у которых эта часть является максимальной и минимальной соответственно.')

