# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

import os

os.system('cls')

print('Сгенерируем ряд чисел, некоторые из которых будут повторяться.')

print()
