# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# 45 -> 101101
# 3 -> 11
# 2 -> 10

import os

os.system('cls')

print('Переведем десятичное число в двоичное.')

n = int(input('Введите десятичное число: '))

