# Вычислить число Пи c заданной точностью d
# Пример: 
# - при d = 0.001, π = 3.141
# - при d = 0.0001, π = 3.1415  

import os

os.system('cls')

print('Найдем число π с заданной точностью до знака после запятой.')

print()


d = int(input('Введите точность вывода числа π в виде 0.1 или 0.01 и так далее: '))

