# Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
# Пример:
# 6 -> [2,3]
# 144 -> [2,3]

import os
import random

os.system('cls')

print('Найдем список, состоящий из попарно перемноженных элементов исходного списка.')

